
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8687949693)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_run_v2_service.cloudrun-dev-main-backend
* Update
  * google_cloud_run_service_iam_policy.noauth


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_service_iam_policy.noauth will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "noauth" {
        id          = "v1/projects/lgtmgen-project/locations/asia-northeast1/services/dev-main-backend"
      ~ policy_data = jsonencode(
          ~ {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
        # (4 unchanged attributes hidden)
    }

  # google_cloud_run_v2_service.cloudrun-dev-main-backend will be created
  + resource "google_cloud_run_v2_service" "cloudrun-dev-main-backend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "dev-main-backend"
      + observed_generation     = (known after apply)
      + project                 = "lgtmgen-project"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/nginx:latest"
              + name  = "nginx"

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "memory" = "1024Mi"
                    }
                }
            }
          + containers {
              + image = "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/backend:latest"
              + name  = "backend"

              + env {
                  + name  = "PORT"
                  + value = "8080"
                }
            }
        }

      + traffic {
          + percent  = 100
          + revision = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":20,"Program":"tfcmt","SHA1":"6fb8a061eb35c3f153a4b2b1c0cb6f1df7de7a05","Target":"dev","Vars":{},"WorkflowName":"Run terragrunt plan on PR submission"} -->